-- Выполенения заданий https://sql-ex.ru/index.php

-- 1) Задание: 1 (Serge I: 2002-09-30)
-- Найдите номер модели, скорость и размер жесткого диска для всех ПК стоимостью менее 500 дол. Вывести: model, speed и hd

    SELECT model, speed, hd FROM PC WHERE price < 500
---------------------------------------------------------------------------------------------------------------------------

-- 2) Задание: 2 (Serge I: 2002-09-21)
-- Найдите производителей принтеров. Вывести: maker

    SELECT DISTINCT maker FROM Product WHERE type = 'Printer'
---------------------------------------------------------------------------------------------------------------------------

-- 3) Задание: 3 (Serge I: 2002-09-30)
-- Найдите номер модели, объем памяти и размеры экранов ПК-блокнотов, цена которых превышает 1000 дол.

    SELECT model, ram, screen FROM Laptop WHERE price > 1000
    ---------------------------------------------------------------------------------------------------------------------------

-- 4) Задание: 4 (Serge I: 2002-09-21)
-- Найдите все записи таблицы Printer для цветных принтеров.

    SELECT * FROM Printer WHERE color = 'y'
---------------------------------------------------------------------------------------------------------------------------

-- 5) Задание: 5 (Serge I: 2002-09-30)
-- Найдите номер модели, скорость и размер жесткого диска ПК, имеющих 12x или 24x CD и цену менее 600 дол.

    SELECT model, speed, hd FROM PC WHERE cd IN ('12x','24x') AND price < 600
---------------------------------------------------------------------------------------------------------------------------

-- 6) Задание: 6 (Serge I: 2002-10-28)
-- Для каждого производителя, выпускающего ПК-блокноты c объёмом жесткого диска не менее 10 Гбайт, 
-- найти скорости таких ПК-блокнотов. Вывод: производитель, скорость.

    SELECT DISTINCT maker, speed FROM Product INNER JOIN Laptop ON Product.model = Laptop.model WHERE hd >= 10
---------------------------------------------------------------------------------------------------------------------------

-- 7) Задание: 7 (Serge I: 2002-11-02)
-- Найдите номера моделей и цены всех имеющихся в продаже продуктов (любого типа) производителя B (латинская буква).

    SELECT product.model, pc.price FROM Product INNER JOIN PC ON product.model = pc.model where maker = 'B'
    UNION
    SELECT product.model, Laptop.price FROM Product INNER JOIN Laptop ON product.model = Laptop.model where maker = 'B'
    UNION
    SELECT product.model,  Printer.price FROM Product INNER JOIN Printer ON product.model = Printer.model where maker = 'B'
---------------------------------------------------------------------------------------------------------------------------

-- 8)Задание: 8 (Serge I: 2003-02-03)
-- Найдите производителя, выпускающего ПК, но не ПК-блокноты.

    SELECT maker FROM Product WHERE type IN ('PC')
    EXCEPT
    SELECT maker FROM Product WHERE type IN ('Laptop')
---------------------------------------------------------------------------------------------------------------------------

-- 9) Задание: 9 (Serge I: 2002-11-02)
-- Найдите производителей ПК с процессором не менее 450 Мгц. Вывести: Maker

    SELECT DISTINCT maker FROM Product Inner JOIN PC ON product.model = pc.model WHERE speed >='450'
---------------------------------------------------------------------------------------------------------------------------

-- 10) Задание: 10 (Serge I: 2002-09-23)
-- Найдите модели принтеров, имеющих самую высокую цену. Вывести: model, price

    SELECT model, price FROM Printer
    WHERE price = (SELECT MAX(price) FROM Printer)
---------------------------------------------------------------------------------------------------------------------------

-- 11)Задание: 11 (Serge I: 2002-11-02)
-- Найдите среднюю скорость ПК.

    SELECT avg(speed) FROM PC
---------------------------------------------------------------------------------------------------------------------------

-- 12)Задание: 12 (Serge I: 2002-11-02)
-- Найдите среднюю скорость ПК-блокнотов, цена которых превышает 1000 дол.

    SELECT avg(speed) AS avg_speed FROM Laptop WHERE price > 1000
---------------------------------------------------------------------------------------------------------------------------

-- 13)Задание: 13 (Serge I: 2002-11-02)
-- Найдите среднюю скорость ПК, выпущенных производителем A.

    Select avg(speed) AS avg_speed FROM PC
    JOIN product ON pc.model = product.model WHERE maker = 'A'
---------------------------------------------------------------------------------------------------------------------------

-- 14)Задание: 14 (Serge I: 2002-11-05)
-- Найдите класс, имя и страну для кораблей из таблицы Ships, имеющих не менее 10 орудий

    Select Ships.class, Ships.name, Classes.country FROM Ships 
    JOIN Classes ON Ships.class = Classes.class WHERE numGuns >= 10
---------------------------------------------------------------------------------------------------------------------------

-- 15)Задание: 15 (Serge I: 2003-02-03)
-- Найдите размеры жестких дисков, совпадающих у двух и более PC. Вывести: HD

    Select hd FROM PC  GROUP BY hd HAVING count(model) >=2
---------------------------------------------------------------------------------------------------------------------------

-- 16)Задание: 16 (Serge I: 2003-02-03)
-- Найдите пары моделей PC, имеющих одинаковые скорость и RAM. В результате каждая пара указывается только один раз, 
-- т.е. (i,j), но не (j,i), Порядок вывода: модель с большим номером, модель с меньшим номером, скорость и RAM.

    SELECT DISTINCT PC.model AS PC_MAX, PC_MIN.model AS PC_MIN, PC.speed, PC.RAM 
    FROM PC, PC as PC_MIN 
    Where 
    PC.model > PC_MIN.model 
    AND PC.ram = PC_MIN.ram 
    AND PC.speed = PC_MIN.speed
---------------------------------------------------------------------------------------------------------------------------

-- 17)Задание: 17 (Serge I: 2003-02-03)
-- Найдите модели ПК-блокнотов, скорость которых меньше скорости каждого из ПК.
-- Вывести: type, model, speed

    SELECT  DISTINCT Product.type, Laptop.model, Laptop.speed 
    FROM Laptop, Product Where laptop.speed < (Select min(speed) FROM PC)
    AND product.type='Laptop'



